qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F0/stm32f0xx_hal_adc.c
      /* Channel sampling time configuration */
      /* Modify sampling time if needed (not needed in case of reoccurrence   */
      /* for several channels programmed consecutively into the sequencer)    */
      if (sConfig->SamplingTime != __HAL_ADC_GET_SAMPLINGTIME(hadc))
      {
        /* Channel sampling time configuration */
        /* Clear the old sample time */
        hadc->Instance->SMPR &= ~(ADC_SMPR_SMP);
        
        /* Set the new sample time */
        hadc->Instance->SMPR |= (sConfig->SamplingTime);
      }

      /* Management of internal measurement channels: Vbat/VrefInt/TempSensor */
      /* internal measurement paths enable: If internal channel selected,     */
      /* enable dedicated internal buffers and path.                          */
      /* @Note: these internal measurement paths can be disabled using         */
      /* HAL_ADC_DeInit() or removing the channel from sequencer with         */
      /* channel configuration parameter "Rank".                              */

      /* If Channel_16 is selected, enable Temp. sensor measurement path. */
      if (sConfig->Channel == ADC_CHANNEL_TEMPSENSOR)
      {
        ADC->CCR |= ADC_CCR_TSEN;
        
        /* Delay for temperature sensor stabilization time */
        while(wait_loop_index < ADC_TEMPSENSOR_DELAY_CPU_CYCLES)
        {
          wait_loop_index++;
        }
      }
      /* If Channel_17 is selected, enable VBAT measurement path. */
      else if (sConfig->Channel == ADC_CHANNEL_VBAT)
      {
        ADC->CCR |= ADC_CCR_VBATEN;
      }
      /* If Channel_18 is selected, enable VREFINT measurement path. */
      else if (sConfig->Channel == ADC_CHANNEL_VREFINT)
      {
        ADC->CCR |= ADC_CCR_VREFEN;
      }

    }
    else
    {
      /* Regular sequence configuration */
      /* Reset the channel selection register from the selected channel */
      hadc->Instance->CHSELR &= ~__HAL_ADC_CHSELR_CHANNEL(sConfig->Channel);
      
      /* Management of internal measurement channels: Vbat/VrefInt/TempSensor */
      /* internal measurement paths disable: If internal channel selected,    */
      /* disable dedicated internal buffers and path.                         */

      /* If Channel_16 is selected, disable Temp. sensor measurement path. */
      if (sConfig->Channel == ADC_CHANNEL_TEMPSENSOR)
      {
        ADC->CCR &= ~ADC_CCR_TSEN;
      }
      /* If Channel_17 is selected, disable VBAT measurement path. */
      else if (sConfig->Channel == ADC_CHANNEL_VBAT)
      {
        ADC->CCR &= ~ADC_CCR_VBATEN;
      }
      /* If Channel_18 is selected, disable VREFINT measurement path. */
      else if (sConfig->Channel == ADC_CHANNEL_VREFINT)
      {
        ADC->CCR &= ~ADC_CCR_VREFEN;
      }
    }
        
  }
   

  /* If a conversion is on going on regular group, no update on regular       */
  /* channel could be done on neither of the channel configuration structure  */
  /* parameters.                                                              */
  else
  {
    /* Update ADC state machine to error */
    hadc->State = HAL_ADC_STATE_ERROR;
    
    tmpHALStatus = HAL_ERROR;
  }
  
  /* Process unlocked */
  __HAL_UNLOCK(hadc);
  
  /* Return function status */
  return tmpHALStatus;
}


/**
  * @brief  Configures the analog watchdog.
  * @note   Possibility to update parameters on the fly:
  *         This function initializes the selected analog watchdog, following  
  *         calls to this function can be used to reconfigure some parameters 
  *         of structure "ADC_AnalogWDGConfTypeDef" on the fly, without reseting 
  *         the ADC.
  *         The setting of these parameters is conditioned to ADC state.
  *         For parameters constraints, see comments of structure 
  *         "ADC_AnalogWDGConfTypeDef".
  * @param  hadc: ADC handle
  * @param  AnalogWDGConfig: Structure of ADC analog watchdog configuration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_AnalogWDGConfig(ADC_HandleTypeDef* hadc, ADC_AnalogWDGConfTypeDef* AnalogWDGConfig)
{
  HAL_StatusTypeDef tmpHALStatus = HAL_OK;
  
  uint32_t tmpAWDHighThresholdShifted;
  uint32_t tmpAWDLowThresholdShifted;
  
  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_FUNCTIONAL_STATE(AnalogWDGConfig->ITMode));

  /* Verify if threshold is within the selected ADC resolution */
  assert_param(IS_ADC_RANGE(__HAL_ADC_GET_RESOLUTION(hadc), AnalogWDGConfig->HighThreshold));
  assert_param(IS_ADC_RANGE(__HAL_ADC_GET_RESOLUTION(hadc), AnalogWDGConfig->LowThreshold));

  if(AnalogWDGConfig->WatchdogMode == ADC_ANALOGWATCHDOG_SINGLE_REG)
  {
    assert_param(IS_ADC_CHANNEL(AnalogWDGConfig->Channel));
  }
  
  /* Process locked */
  __HAL_LOCK(hadc);
  
  /* Parameters update conditioned to ADC state:                              */
  /* Parameters that can be updated when ADC is disabled or enabled without   */
  /* conversion on going on regular group:                                    */
  /*  - Analog watchdog channels                                              */
  /*  - Analog watchdog thresholds                                            */
  if (__HAL_ADC_IS_CONVERSION_ONGOING_REGULAR(hadc) == RESET)
  {
    /* Configuration of analog watchdog:                                      */
    /*  - Set the analog watchdog enable mode: one or overall group of        */
    /*    channels.                                                           */
    /*  - Set the Analog watchdog channel (is not used if watchdog            */
    /*    mode "all channels": ADC_CFGR_AWD1SGL=0).                           */
    hadc->Instance->CFGR1 &= ~( ADC_CFGR1_AWDSGL |
                                ADC_CFGR1_AWDEN  |
                                ADC_CFGR1_AWDCH   );
    
    hadc->Instance->CFGR1 |= ( AnalogWDGConfig->WatchdogMode                 |
                               __HAL_ADC_CFGR_AWDCH(AnalogWDGConfig->Channel) );

    /* Shift the offset in function of the selected ADC resolution: Thresholds*/
    /* have to be left-aligned on bit 11, the LSB (right bits) are set to 0   */
    tmpAWDHighThresholdShifted = __HAL_ADC_AWD1THRESHOLD_SHIFT_RESOLUTION(hadc, AnalogWDGConfig->HighThreshold);
    tmpAWDLowThresholdShifted  = __HAL_ADC_AWD1THRESHOLD_SHIFT_RESOLUTION(hadc, AnalogWDGConfig->LowThreshold);
    
    /* Set the high and low thresholds */
    hadc->Instance->TR &= ~(ADC_TR_HT | ADC_TR_LT);
    hadc->Instance->TR |=  ( __HAL_ADC_TRX_HIGHTHRESHOLD (tmpAWDHighThresholdShifted) |
                             tmpAWDLowThresholdShifted                                 );
    
    /* Clear the ADC Analog watchdog flag (in case of left enabled by         */
    /* previous ADC operations) to be ready to use for HAL_ADC_IRQHandler()   */
    /* or HAL_ADC_PollForEvent().                                             */
    __HAL_ADC_CLEAR_FLAG(hadc, ADC_IT_AWD);
    
